app/views/tweets/index.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 23
---
          <%= button_to tweet_like_path(id: t.id, tweet_id: t.id), method: :delete do %>
            <i class="fas fa-heart"></i><%= t.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 26
---
          <%= button_to tweet_likes_path(id: t.id, tweet_id: t.id), method: :post do %>
            <i class="far fa-heart"></i><%= t.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 23
---
      <% else %>
      <i class="far fa-heart"></i><%= t.likes.count %>