app/views/tweets/show.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 23
---
          <%= link_to tweet_like_path(@tweet), method: :delete do %>
            <i class="fas fa-heart"></i><%= @tweet.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 31
---
          <%= link_to tweet_likes_path(@tweet), method: :post do %>
            <i class="far fa-heart"></i><%= @tweet.likes.count %>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
---
    <div>
      <%= c.user.email unless c.user.blank? %>