app/views/users/show.html.erb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 1
---
<h4>投稿一覧</h4>
<% @user.tweets.each do |t| %>