app/controllers/comments_controller.rb

    def create
      tweet = Tweet.find(params[:tweet_id])
      comment = tweet.comments.build(comment_params) #buildを使い、contentとtweet_idの二つを同時に代入
      comment.user_id = current_user.id
      if comment.save
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1
INSERT INTO `comments` (`content`, `user_id`, `tweet_id`, `created_at`, `updated_at`) VALUES ('aaa', 1, 12, '2021-03-12 14:07:52.989390', '2021-03-12 14:07:52.989390')