app/controllers/likes_controller.rb

INSERT INTO `likes` (`tweet_id`, `user_id`, `created_at`, `updated_at`) VALUES (21, 1, '2021-03-12 15:31:27.341850', '2021-03-12 15:31:27.341850')
---
    def create
        like = current_user.likes.create(tweet_id: params[:tweet_id])

SELECT `likes`.* FROM `likes` WHERE `likes`.`tweet_id` = 21 AND `likes`.`user_id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1
---
    def destroy
        like = Like.find_by(tweet_id: params[:tweet_id], user_id: current_user.id)
        like.destroy