app/controllers/tweets_controller.rb

    def index
      if params[:search] == nil
        @tweets= Tweet.all.order(id: "DESC")
      elsif params[:search] == ''
        @tweets= Tweet.all
---
SELECT `tweets`.* FROM `tweets` ORDER BY `tweets`.`id` DESC
SELECT `tweets`.* FROM `tweets` WHERE (body LIKE '%あ%' )

    def create
      tweet = Tweet.new(tweet_params)
      tweet.user_id = current_user.id

      if tweet.save
---
INSERT INTO `tweets` (`body`, `created_at`, `updated_at`, `user_id`, `image`) VALUES ('', '2021-03-18 11:40:05.484916', '2021-03-18 11:40:05.484916', 1, 'chara_3_sd.png')

    def show
        @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 24 LIMIT 1

    def update
      tweet = Tweet.find(params[:id])
      if tweet.update(tweet_params)
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 2 LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = 'あ・・・l', `tweets`.`updated_at` = '2021-03-12 14:53:32.127404' WHERE `tweets`.`id` = 21

    def destroy
      tweet = Tweet.find(params[:id])
      tweet.destroy
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 11 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 11